Ran Plan for project: `infra` dir: `infra-local` workspace: `default`

<details><summary>Show Output</summary>

```diff
Starting custom workflow

Initializing Terraform...
Initializing the backend...
Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.83.1...
- Installed hashicorp/aws v5.83.1 (signed by HashiCorp)
Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Cleaning up previous plan files...

Generating Terraform plan in JSON format...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.my_database will be created
  + resource "aws_db_instance" "my_database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "appdb"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + iops                                  = (known after apply)
      + kms_key_id                            = "arn:aws:kms:us-west-2:123456789012:key/abcd-1234"
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "Production"
          + "Name"        = "MyDatabase"
          + "Team"        = "DevOps"
        }
      + tags_all                              = {
          + "Environment" = "Production"
          + "Name"        = "MyDatabase"
          + "Team"        = "DevOps"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_instance.app_server will be created
  + resource "aws_instance" "app_server" {
      + ami                                  = "ami-0c55b159cbfafe1f0"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "Production"
          + "Name"        = "AppServer"
          + "Team"        = "DevOps"
        }
      + tags_all                             = {
          + "Environment" = "Production"
          + "Name"        = "AppServer"
          + "Team"        = "DevOps"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = (known after apply)
        }
    }

  # aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-app-logs-12345"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "ApplicationLogs"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "ApplicationLogs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_server_side_encryption_configuration.logs_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "logs_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.logs_versioning will be created
  + resource "aws_s3_bucket_versioning" "logs_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_subnet.private will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "Production"
          + "Name"        = "main-vpc"
          + "Team"        = "DevOps"
        }
      + tags_all                             = {
          + "Environment" = "Production"
          + "Name"        = "main-vpc"
          + "Team"        = "DevOps"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

Running OPA policy checks...
## OPA Policy Check Results
DEBUG: OPA Output Structure:
{
  "result": [
    {
      "expressions": [
        {
          "value": [
            "Database 'aws_db_instance.my_database' is not encrypted. Encryption must be enabled.",
            "Instance 'aws_instance.app_server' has an invalid instance type 't2.micro'. Allowed types: t3.micro, t3.small",
            "S3 bucket 'aws_s3_bucket.logs' is missing the 'Team' tag",
            "Subnet 'aws_subnet.public' allows public IP mapping on launch, which is not allowed"
          ],
          "text": "data.terraform.analysis.violations",
          "location": {
            "row": 1,
            "col": 1
          }
        }
      ]
    }
  ]
}
Generating Markdown table...
Generated Comment:
### OPA Policy Violations Detected!
| #   | Violation Message                                                                 |
|-----|-----------------------------------------------------------------------------------|
| 21 | Database 'aws_db_instance.my_database' is not encrypted. Encryption must be enabled. |
| 21 | Instance 'aws_instance.app_server' has an invalid instance type 't2.micro'. Allowed types: t3.micro, t3.small |
| 21 | S3 bucket 'aws_s3_bucket.logs' is missing the 'Team' tag |
| 21 | Subnet 'aws_subnet.public' allows public IP mapping on launch, which is not allowed |
-e 
**Fix these violations before applying Terraform!**
Generated Comment:
-e ### OPA Policy Violations Detected!

| 1 | Database 'aws_db_instance.my_database' is not encrypted. Encryption must be enabled. |
| 2 | Instance 'aws_instance.app_server' has an invalid instance type 't2.micro'. Allowed types: t3.micro, t3.small |
| 3 | S3 bucket 'aws_s3_bucket.logs' is missing the 'Team' tag |
| 4 | Subnet 'aws_subnet.public' allows public IP mapping on launch, which is not allowed |
-e 
 **Fix these violations before applying Terraform!**

Posting a Custom Comment to GitHub...
📜 Debugging comment.md content...
-e ### OPA Policy Violations Detected!$
$
| 1 | Database 'aws_db_instance.my_database' is not encrypted. Encryption must be enabled. |$
| 2 | Instance 'aws_instance.app_server' has an invalid instance type 't2.micro'. Allowed types: t3.micro, t3.small |$
| 3 | S3 bucket 'aws_s3_bucket.logs' is missing the 'Team' tag |$
| 4 | Subnet 'aws_subnet.public' allows public IP mapping on launch, which is not allowed |$
-e $
 **Fix these violations before applying Terraform!**$
-------------------------------------
-e ### OPA Policy Violations Detected!

| 1 | Database 'aws_db_instance.my_database' is not encrypted. Encryption must be enabled. |
| 2 | Instance 'aws_instance.app_server' has an invalid instance type 't2.micro'. Allowed types: t3.micro, t3.small |
| 3 | S3 bucket 'aws_s3_bucket.logs' is missing the 'Team' tag |
| 4 | Subnet 'aws_subnet.public' allows public IP mapping on launch, which is not allowed |
-e 
 **Fix these violations before applying Terraform!**
Generated JSON Payload:
parse error: Invalid string: control characters from U+0000 through U+001F must be escaped at line 9, column 1
{
  "url": "https://api.github.com/repos/shanksfk/atlantis-server-test/issues/comments/2637483424",
  "html_url": "https://github.com/shanksfk/atlantis-server-test/pull/3#issuecomment-2637483424",
  "issue_url": "https://api.github.com/repos/shanksfk/atlantis-server-test/issues/3",
  "id": 2637483424,
  "node_id": "IC_kwDONxxnaM6dNM2g",
  "user": {
    "login": "shanksfk",
    "id": 92335127,
    "node_id": "U_kgDOBYDsFw",
    "avatar_url": "https://avatars.githubusercontent.com/u/92335127?v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/shanksfk",
    "html_url": "https://github.com/shanksfk",
    "followers_url": "https://api.github.com/users/shanksfk/followers",
    "following_url": "https://api.github.com/users/shanksfk/following{/other_user}",
    "gists_url": "https://api.github.com/users/shanksfk/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/shanksfk/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/shanksfk/subscriptions",
    "organizations_url": "https://api.github.com/users/shanksfk/orgs",
    "repos_url": "https://api.github.com/users/shanksfk/repos",
    "events_url": "https://api.github.com/users/shanksfk/events{/privacy}",
    "received_events_url": "https://api.github.com/users/shanksfk/received_events",
    "type": "User",
    "user_view_type": "public",
    "site_admin": false
  },
  "created_at": "2025-02-05T16:50:45Z",
  "updated_at": "2025-02-05T16:50:45Z",
  "author_association": "OWNER",
  "body": "-e ### OPA Policy Violations Detected!\n\n| 1 | Database 'aws_db_instance.my_database' is not encrypted. Encryption must be enabled. |\n| 2 | Instance 'aws_instance.app_server' has an invalid instance type 't2.micro'. Allowed types: t3.micro, t3.small |\n| 3 | S3 bucket 'aws_s3_bucket.logs' is missing the 'Team' tag |\n| 4 | Subnet 'aws_subnet.public' allows public IP mapping on launch, which is not allowed |\n-e \n **Fix these violations before applying Terraform!**\n",
  "reactions": {
    "url": "https://api.github.com/repos/shanksfk/atlantis-server-test/issues/comments/2637483424/reactions",
    "total_count": 0,
    "+1": 0,
    "-1": 0,
    "laugh": 0,
    "hooray": 0,
    "confused": 0,
    "heart": 0,
    "rocket": 0,
    "eyes": 0
  },
  "performed_via_github_app": null
}
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p infra
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://3287349f700985:4141/lock?id=shanksfk%252Fatlantis-server-test%252Finfra-local%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p infra
  ```
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```